const categories = [
    ["스타벅스", "이디야", "빽다방", "커피"],
    ["교보문고", "알라딘", "예스24", "인터파크", "CGV", "롯데시네마"],
    ["배스킨라빈스", "하겐다즈"],
    ["BBQ", "BHC", "교촌", "도미노", "피자헛"], 
    ["이마트24", "GS25", "CU"],
    ["올리브영", "코스메틱"],
    ["CJ 상품권", "이마트,신세계", "롯데모바일"],
    ["광동생활건강", "고려은단", "동아제약", "정관장", "종근당"],
    ["맥도날드", "롯데리아", "버거킹", "KFC", "맘스터치", "노브랜드버거"]
    ["에잇세컨즈", "스파오", "지오다노", "미쏘", "탑텐", "유니클로"],
    ["파리바게뜨", "파리크라상", "뚜레쥬르", "신라명과"],
    ["텐바이텐", "북아이템"]
]
const categoryname = [
    "커피/음료",
    "도서/문화",
    "아이스크림",
    "치킨/피자",
    "편의점",
    "뷰티",
    "상품권",
    "건강",
    "패스트푸드",
    "패션/SPA",
    "베이커리",
    "문구/소품"
]

const getCategory = (str) =>
{
    for(let i = 0; i < categories.length; i++)
    {
        for(let j = 0; j < categories[i].length; j++)
        {
            if (str.match(categories[i][j])) return categoryname[i];
        }
    }
    return "기타";
}

exports.getCategory = getCategory;